[
	{
		"index": 0,
		"id":"ikea",
		"imgSrc": "assets/img/work/ptb/ptb-tile",
		"imgType": "jpg",
		"clientName": "IKEA",
		"description": "Interative Quiz and Photobooth",
		"altText": "IKEA",
		"trackingLabel": "Home|Click|IKEA_Work",
		"csHero":"assets/img/work/ptb/ptb5",
		"csHeroCaption":"",
		"csHeroType":"vimeo",
		"csHeroVideo":"3a2f46ea9d",
		"csTitle":"Interative Quiz and Photobooth",
		"csOverview":"When IKEA turned 75 they wanted to promote their new catalog in a fun way. We developed a web-based 75-question quiz, completed by scanning QR codes scattered throughout 4-rooms. I lead developers in the technical requirements, user experience and creative execution of the AR browser application.<br/><br/>Additionally, our team created an dynamic photobooth that used tangible objects (including the pull-string of an IKEA lamp) as user inputs. Users were able to time travel through fun iconography and ultimately send themselves their images via SMS.",
		"csResponsibilities":"Technology Management; UX; Quality Assurance; On-going maintenance and enhancements; On-site Training and Trouble Shooting",
		"csTechnology":"HTML5, NodeJS, CSS, AR, Firebase Database, OpenFramework, AWS",
		"csChallenges":"Prior to the activations, we coordinated with vendors to secure and install a Wi-Fi network to handle hundreds of simultaneous connections. During the activations, I interacted with, trained and assisted a 20-person team as well as assisted thousands of customers over 9 days in multiple cities.",
		"csResults":"The onsite feedback and excitement we received from the client and the visitors was incredible. We created a fun experience that thousands of people were compelled to visit again and again. We’ve since optimized the quiz and website to be more manageable by a smaller staff. This smaller version has been used to promote multiple store openings across the country.",
		"csAdditionalPics":[
			{"imgSrc":"assets/img/work/ptb/ptb7a", "caption":"Will you push the button?"},
			{"imgSrc":"assets/img/work/ptb/ptb6", "caption":"Track your teams score on the website"},
			{"imgSrc":"assets/img/work/ptb/ptb1", "caption":"Eastside Gridlox vs. Westside Trackfires"},
			{"imgSrc":"assets/img/work/ptb/ptb2", "caption":"Propoganda posters"},
			{"imgSrc":"assets/img/work/ptb/ptb3", "caption":"Thousands of selfies!!"},
			{"imgSrc":"assets/img/work/ptb/ptb4", "caption":"Which side will you stand on?"}
		]
	},
	{
		"index": 1,
		"id":"ibm-think",
		"imgSrc": "assets/img/work/marriott/mi-tile",
		"imgType": "jpg",
		"clientName": "IBM Think",
		"description": "Photo Studio",
		"altText": "IBM Think",
		"trackingLabel": "Home|Click|IBM_Work",
		"csHero":"assets/img/work/marriott/mi_hero",
		"csHeroCaption":"Photo Studio",
		"csHeroType":"image",
		"csHeroVideo":"",
		"csTitle":"Photo Studio at IBM Think 2018",
		"csOverview":"Watching people interact with your technology is one of my favorite things. In the best case scenario, they flow through your experience and hardly notice the technology at all. Sometimes the payoff even exceed your expectation.<br/><br/>For the IBM Think conference in 2018, we created an admin tool to register users for a private session within a Portrait Studio. We gathered their basic information and stored it along with a digital talent release form and a professional headshot. These assets were then displayed larger than life on a huge digital billboard in the heart of downtown Las Vegas.<br/><br/>We worked closely with talent representing our client and company in a professional yet fun and stress-free environment. This was a true example of the creative and experience leading the technology.",
		"csResponsibilities":"Technology Architecture & Management; UX; On-site Training and Trouble Shooting; Quality Assurance",
		"csTechnology":"HTML5, CSS, NodeJS, SoftLayer, CloundantDB",
		"csChallenges":"Keeping this tool as simple as possible proved to be a key to its success. The UX and design were intentially uncomplicated to let the basic functionality shine. Working with the display vendor had a few hiccups, but ulitmately everything fell into place.",
		"csResults":"When the technology is working as expected, everyone has a good time. The experience was simple and lauded by everyone involved. The client was so pleased that we optimized and iterated the features of our code to do it again the following year in San Francisco.",
		"csAdditionalPics":[
			{"imgSrc":"assets/img/work/marriott/mi1", "caption":"Screen from <a data-tracking-label='MI|Click|RI' href='residenceinn.marriott.com'>residenceinn.marriott.com</a>"},
			{"imgSrc":"assets/img/work/marriott/mi2", "caption":"Screen from <a data-tracking-label='MI|Click|FI' href='fairfield.marriott.com'>fairfield.marriott.com</a>"},
			{"imgSrc":"assets/img/work/marriott/mi3", "caption":"Screen from <a data-tracking-label='MI|Click|SHS' href='springhillsuites.marriott.com'>springhillsuites.marriott.com</a>"},
			{"imgSrc":"assets/img/work/marriott/mi4", "caption":"Screen from <a data-tracking-label='MI|Click|CY' href='courtyard.marriott.com'>courtyard.marriott.com</a>"}
		]
	},
	{
		"index": 2,
		"id":"network-fleet",
		"imgSrc": "assets/img/work/networkfleet/nf-tile",
		"imgType": "jpg",
		"clientName": "Network Fleet",
		"description": "Website for Verizon",
		"altText": "PowerfulAnswers by Verizon",
		"trackingLabel": "Home|Click|NF_Work",
		"csHero":"",
		"csHeroCaption":"Screen capture of website",
		"csHeroType":"vimeo",
		"csHeroVideo":"116988638",
		"csTitle":"PowerfulAnswers by Verizon",
		"csOverview":"The Powerful Answers campaign showcased how Verizon uses innovative technology to find solutions to the world’s biggest challenges. Each phase of the campaign featured a unique solution promoted on TV and accompanied by more in-depth information online. It was our goal to create an online experience that matched each solution with an equally innovative, adaptive website ensuring an optimal experience across devices.",
		"csResponsibilities":"Development team leadership and technical oversight; Programming; Client communication and documentation; Quality Assurance",
		"csTechnology":"HTML5, Javascript, CSS, PHP, YouTube",
		"csChallenges":"The main challenge we encountered was handling the assets across all devices. Using adaptive development we were able to determine the best experience for each user's device.",
		"csResults":"The analtyics showed a much improved brand affinity among millennials while increasing the time on site and reducing the bounce rate.",
		"csAdditionalPics":[
			{"imgSrc":"assets/img/work/networkfleet/nf2", "caption":""},
			{"imgSrc":"assets/img/work/networkfleet/nf1", "caption":""},
			{"imgSrc":"assets/img/work/networkfleet/nf3", "caption":""}
		]
	},
	{
		"index": 3,
		"id":"performance",
		"imgSrc": "assets/img/work/ng/ng-tile",
		"imgType": "jpg",
		"clientName": "Performance",
		"description": "Northrop Grummann Microsite",
		"altText": "Northrop Grumman",
		"trackingLabel": "Home|Click|NG_Work",
		"csHero":"assets/img/work/ng/ng1",
		"csHeroCaption":"",
		"csHeroType":"image",
		"csHeroVideo":"",
		"csTitle":"Website for Northrop Grumman",
		"csOverview":"Northrop Grumman is on the cutting edge of technology. Their acheivements go far beyond warfare to include advancements that benefit space exploration, communication and artificial intelligence. We were tasked to showcase the breadth of their abilities with a responsive video-heavy website.",
		"csResponsibilities":"Development team leadership and technical oversight; Programming; Client communication and documentation; Asset Management and Optimization; Quality Assurance",
		"csTechnology":"HTML5, AngularJS, JWPlayer, CSS, JSON, YouTube, Custom Gulp Preprocessors",
		"csChallenges":"<em>Infrastructure</em> - Working within the Northrop firewall prevented some internal teams from using websites like Youtube, but since this was a video site they had concerns about bandwidth usage. We devised a way to determine when this was an issue and serve up local versions of the video content.<br/><br/><em>Asset Management</em> - Overlaying 3D elements was acheived by using a series of png sequences built and optimized in a way that restrict server calls.",
		"csResults":"The site was well received and can be viewed by <a data-tracking-label='NG|Click|Performance' href='http://www.northropgrumman.com/performance/' target='_blank'>clicking here</a>.",
		"csAdditionalPics":[
			{"imgSrc":"assets/img/work/ng/ng6", "caption":""},
			{"imgSrc":"assets/img/work/ng/ng3", "caption":""},
			{"imgSrc":"assets/img/work/ng/ng7", "caption":""},
			{"imgSrc":"assets/img/work/ng/ng2", "caption":""}
		]
	},
	{
		"index": 4,
		"id":"avatar-creator",
		"imgSrc": "assets/img/work/avatar/av-tile",
		"imgType": "jpg",
		"clientName": "Avatar Creator",
		"description": "Custom built HTML5 animation tool",
		"altText": "Various animated expressions",
		"trackingLabel": "Home|Click|AV_Work",
		"csHero":"assets/img/work/avatar/av1",
		"csHeroCaption":"Animation made directly in the browser!",
		"csHeroType":"youtube",
		"csHeroVideo":"xkeJ_gtlaIM",
		"csTitle":"Personal Coding Experiments",
		"csOverview":"What started out as an experiment exploring the animation and design capabilities of CSS turned into full-fledged animation tool powered solely by the browser. The end result was never intended at first, but as each feature was succesfully added, new ones were considered and completed.",
		"csResponsibilities":"Responsible for everything.",
		"csTechnology":"HTML5, Javascript, CSS, GreenSock Tweening Librariesm, Parse Database",
		"csChallenges":"The entire project was challenging and full of unknowns. I wasn't sure if anything I was tryihng to acheive was even possible. Perhaps the biggest challenge was not having a clearly defined roadmap. As a result, there was a lot of recoding required to account for the lack of vision.",
		"csResults":"The UX proved to be the achilles heal. When this proof-of-concept was complete, I ended up being the only one who was really able to animate with it, and it wasn't easy. I have always considered this project to be a success as far as exploration and experimentation into what could be done solely in the browser. Now that I know what is possible and what doesn't work, I have plans to make another attempt at this project in the future.",
		"csAdditionalPics":[
			{"imgSrc":"assets/img/work/avatar/av1", "caption":"Customize how your avatar looked"},
			{"imgSrc":"assets/img/work/avatar/av-tile", "caption":"A few examples of expressions"}
		]
	},
	{
		"index": 6,
		"id":"fetch",
		"imgSrc": "assets/img/work/fetch/fetch-tile",
		"imgType": "jpg",
		"clientName": "Fetch",
		"description": "Graduate Thesis Animation",
		"altText": "Still from Fetch animation",
		"trackingLabel": "Home|Click|FETCH_Work",
		"csHero":"assets/img/work/fetch/fetch1",
		"csHeroCaption":"",
		"csHeroType":"youtube",
		"csHeroVideo":"kTX79qXHCKU",
		"csTitle":"NYU Thesis Animation",
		"csOverview":"Fetch is a 3-minute animation about the atypical relationship between a little girl and her dog. It was the thesis project that culminated a two-year MS Degree in Computer Imaging and Design at NYU.",
		"csResponsibilities":"Responsible for everything except <a data-tracking-label='FETCH|Click|AndyRalls' href='http://andyralls.com/' target='_blank'>the music.</a>",
		"csTechnology":"Maya, After Effects, ProTools",
		"csChallenges":"Character animation was the biggest challenge of this project, but communicating a simple idea through story-telling was a close second. These challenges were compounded by having to learn all the technology required to make a solo animated short.",
		"csResults":" This <em>award-winning</em> animation has been viewed over 300,000 times online and fostered organization, documentation and communication and was the key component to earning my Master's Degree with honors.",
		"csAdditionalPics":[
			{"imgSrc":"assets/img/work/fetch/fetch1", "caption":""},
			{"imgSrc":"assets/img/work/fetch/fetch2", "caption":"Various image from pre and post production"}
		]
	}
]
